from Chess_task import good_position, NEED_GOOD_POSITIONS

"""
Напишите функцию в шахматный модуль. Используйте генератор случайных чисел для случайной расстановки ферзей в задаче выше.
Проверяйте различный случайные  варианты и выведите 4 успешных расстановки.
"""

print("4 успешные расстановки 8 ферзей: ")
good_position(NEED_GOOD_POSITIONS)
